[{"title":"ABOUT HILLARY’S COUGH: We Discovered The Secret To Why She Keeps Coughing [Video]","text":" ","subject":"politics","date":"Jul 20, 2016"},{"title":"BREAKING: OBAMACARE REPEAL Clears First Hurdle…Dems Get Snarky","text":"The Senate voted 51-48 this afternoon to proceed to the resolution, S. Con. Res. 3, which would set up a filibuster-proof process, ensuring the chamber s consideration of legislation repealing parts of Obamacare and replacing it, either as one bill or as separate measures.The 54-page document, unveiled yesterday by Budget Chairman Mike Enzi, directs committees of jurisdiction to come up with Affordable Care Act legislation by Jan. 27, meaning a repeal bill could be to Donald Trump s desk by the end February, lawmakers said today.The House Ways and Means and Energy and Commerce as well as the Senate Finance and Health, Education, Labor, and Pensions committees are charged with drafting the legislation.Senate action came as Obama and Pence both headed to the Capitol to meet with their respective parties to discuss efforts to preserve or undo the health-care law. House Ways and Means Chairman Kevin Brady of Texas said that an Obamacare replacement proposal would be laid out on a step-by-step basis and could be fully written by the August recess.The Obama administration immediately hit back with the comment that the Senate vote was passed by a  pretty narrow margin Josh Earnest went on to say that the Republicans will be responsible for the ensuing chaos LOL! Via: ZH","subject":"politics","date":"Jan 4, 2017"},{"title":"‘SLEEPY’ JUSTICE GINSBURG: Excites Crowd By Saying She’d Back Abolition Of The Electoral College [Video]","text":"So much for the SCOTUS not being political Check out her comments on equality for women. It s like she s time traveled back to the 50 s. What is the deal with these women that think we re still in the dark ages!","subject":"left-news","date":"Feb 7, 2017"},{"title":" WATCH: Kellyanne Conway Very Upset Hillary Clinton Is Not Doing Trump’s Job","text":"White House counselor Kellyanne Conway crawled out of her crypt after two weeks in hiding to attack Hillary Clinton who is totally not the President. Former reality show star Donald Trump was sworn in 216 days ago (seems longer, huh?) and his administration is still talking about his former rival. It s not too surprising since Trump is still in campaign mode, holding rallies, likely because he still doesn t know how to President.On Thursday, Conway appeared on  Fox & Friends  to lash out at Trump s critics, the media, and Hillary Clinton for daring to write a book because books are bad, apparently. Where s her big c4 trying to help women and children around the globe?  Conway asked as if the Clinton Foundation which helps women and children around the globe does not exist.Conway then just wondered why Clinton is not doing Trump s job. Where s her bipartisan effort to try to help with infrastructure and meaningful tax reform, or the opioid crisis that I work on in the building behind me every single day?  Conway asked.Trump s policies and attempted legislation have failed to pass. There s been an exodus of staffers at various councils after his appalling speech on the Charlottesville attack which left one dead and 19 others injured. Thanks, Hillary!Someone, please tell Trump that Hillary Clinton is not holding an elected office. Passing infrastructure bills and handling the opioid crisis is all on Trump. Eradicating Obamacare would have a devastating effect on those suffering from the disease of addiction who wish to get treatment. Thanks again, Hillary.Conway then claimed that Hillary Clinton  failed to make history,  even though she won the popular vote and was the first woman to become the presidential nominee of a major party in the U.S.Watch: It s way over the line.   @KellyannePolls reacts to James Clapper questioning Pres. Trump s fitness for office pic.twitter.com\/w4Db17t6g5  FOX & friends (@foxandfriends) August 24, 2017But Trump has tried to claim repeatedly that he won the popular vote (he did not win the popular vote) but thanks for weighing in, Kellyanne. Back to the crypt with you!Image via screen capture. ","subject":"News","date":"August 24, 2017"},{"title":" GOP Gives Trump The Middle Finger, Prepares To Launch Probe Into Russia","text":"Donald Trump may have decided that Russia is going to be America s new BFF, but the rest of the GOP isn t so sure. Going against the incoming administration, several Republicans are preparing to launch a wide-ranging investigation into Russia, particularly their involvement with hacking and alleged interference in the presidential election.The Washington Post reported:Senate Armed Services Committee Chairman John McCain (Ariz.) is readying a probe of possible Russian cyber-incursions into U.S. weapons systems, and he said he has been discussing the issue with Senate Select Intelligence Committee Chairman Richard Burr (N.C.), with whom he will be  working closely  to investigate Russia s suspected interference in the U.S. elections and cyberthreats to the military and other institutions. Senate Majority Leader Mitch McConnell (R-Ky.) has been apprised of the discussions. Burr did not respond to requests for comment.Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.) also said he intends to hold hearings next year into alleged Russian hacking. Corker is on Trump s shortlist for secretary of state, according to the Trump transition team.Two of the most vocal voices on team Probe Putin are McCain and Sen. Lindsey Graham.Graham said that Russia will  keep doing more here until they pay a price.  Next year, he plans to head up legislation and hold investigative hearings on  Russia s misadventures throughout the world,  which will absolutely include Russian interference in the U.S. election. I m going after Russia in every way you can go after Russia. I think they re one of the most destabilizing influences on the world stage. I think they did interfere with our elections, and I want Putin personally to pay the price,  Graham told CNN on Wednesday.McCain said his Armed Services Committee is going to be investigating Russia s cyber capabilities and the extent that they could be used against the U.S. military and our weapons systems,  because the real threat is cyber.  McCain added that this investigation will probably veer off to include looking at the possibility Russia was behind the DNC hacking. Also on the list to be probed is the hacking of state-based election systems, including that of Arizona, McCain s home state. See, the problem with hacking is that if they re able to disrupt elections, then it s a national security issue, obviously,  McCain said on Thursday.He noted that the Armed Services Committee was  still formulating  just exactly how they would go about dealing with the issue, but said   there s very little doubt  that Russia was meddling in the U.S. election process, which he insists is very worthy of examination. Trump has dismissed the possibility that Russia was responsible for the DNC hacking, despite the fact that he himself called on the country to find  Hillary Clinton s missing emails. I don t believe they interfered,  Trump said.  It could be Russia. And it could be China. And it could be some guy in his home in New Jersey. I believe that it could have been Russia and it could have been any one of many other people. Sources or even individuals. Featured image via Joe Raedle\/Getty Images and Thierry Chesnot\/Getty Images. Images merged by Rika Christensen","subject":"News","date":"December 9, 2016"},{"title":" Trump Displays Incredible Ignorance Yet Again — Claims Credit For Term Coined Over A Hundred Years Ago","text":"Have you ever wondered where a phrase started? How about the phrase  prime the pump?  It is widely considered to mean the use of government money to get a project going. While it dates back to the 1800s, President Donald Trump is now claiming that he invented the phrase. In reality, the use of the phrase  prime the pump  predates Trump s own birth by a hundred years, and the use of it in the current economic sense has existed since the 1930s.In a recent conversation with The Economist, this exchange happened (they were talking about Trump s tax plan):The Economist: But beyond that it s OK if the tax plan increases the deficit? Trump: It is OK, because it won t increase it for long. You may have two years where you ll you understand the expression  prime the pump ? The Economist: Yes. Trump: We have to prime the pump. The Economist: It s very Keynesian. Trump: We re the highest-taxed nation in the world. Have you heard that expression before, for this particular type of an event? The Economist: Priming the pump? Trump: Yeah, have you heard it? The Economist: Yes. Trump: Have you heard that expression used before? Because I haven t heard it. I mean, I just I came up with it a couple of days ago and I thought it was good. It s what you have to do.According to The Free Dictionary:Prime the Pump: Encourage the growth or action of something, as in  Marjorie tried to prime the pump by offering some new issues for discussion.  In the late 1800s this expression originally was used for pouring liquid into a pump to expel the air and make it work. In the 1930s it was applied to government efforts to stimulate the economy and thereafter was applied to other undertakings.It is hardly surprising that a) Trump had never heard this phrase, as it is rarely used on Twitter and b) he would take credit for it. In a week with so many gaffes, lies and just strange behavior, this may not be as big an issue but it s clear how little this man knows and how little he understands the world and reality that the rest of us live in. Another explanation could be that Trump is much, much older than we have been led to believe and has gone completely senile.Featured image via Photo by Joe Raedle\/Getty Images.","subject":"News","date":"May 11, 2017"},{"title":" Anthony Bourdain Reveals The ‘ONE Good Thing’ About Trump And It’s HILARIOUS","text":"While Donald Trump is currently freaking out because he hasn t been able to find anyone to perform at his inauguration (which is just a few short weeks away at this point), master chef Anthony Bourdain is making sure he rubs salt in Trump s open wounds.Never one to mince his words, Bourdain first asserted himself as an anti-Trump celebrity when he was asked if he d ever dine with Trump during his presidential campaign. Bourdain s reply was blunt and brutal   he said, Absolutely f*cking not. And Bourdain hasn t changed his tone about Trump, not even after the phony business mogul has been elected. In a recent interview with Eater s Helen Rosner, Bourdain further confirmed that he is as anti-Trump as ever. During the interview, Bourdain clearly stated that he was concerned about what Trump s presidency meant for his daughter   rightfully so, as any parent should be. But while Trump s presidency means horrible things for many people who aren t rich white men, Bourdain was able to find one silver lining.In stating that he would never attend Trump s White House Correspondents  dinner, Bourdain stated that at least Trump would probably put an end to it. He said: I doubt there will be another. Thank god, that s an institution I d like to see die for years. If there s one good thing to come out of the Trump administration, let it be that there will be no more White House Correspondents  dinners. It reinforces all the world s worst notions about the hideous, inside-the-beltway, all-in-it-together culture. It brings honor to no one to have Kim Kardashian or Tara Reid sitting there next to a news anchor. What is this all about? F*ck that. If I m gonna make fun of you today, I m not accepting your food tomorrow. I had dinner with President Obama, but I paid. We were offered Air Force One, and I said,  There s no way. No way. Well, he s probably right. Not only would there be several empty seats, but the only people who would actually attend would be swamp monsters just like Trump. This is surely going to be one sour reminder to Trump that he is extremely unpopular and will never be accepted in the way that President Barack Obama was embraced by most of America. You can read the rest of Bourdain s anti-Trump interview on Eater.Featured image via Astrid Stawiarz \/ Getty Images","subject":"News","date":"December 22, 2016"},{"title":"TRUMP HITS BACK After Cowgirl Congresswoman Trashes Him Over Words Said to Grieving Widow","text":"The left is going ballistic over supposed words said by President Trump to a grieving military widow.  President Trump made a call to Myeshia Wilson that s been turned into a political football by the left to make Trump out to be  crazy . Wilson s husband was killed in Niger while serving in our military so President Trump was making a sympathy call to Mrs. Wilson. Unfortunately, Wilson s family has been put in the middle of an effort to bash Trump.The media also wasted no time covering this story. They re doing their best to try and make Trump look as bad as possible Just another day in the life of the lefty media.Far left Congresswoman  Frederica Wilson jumped right in to trash Trump after the call. She s following the left s narrative by claiming Trump is a  sick man .  It s pretty funny that Wilson calls Trump crazy while wearing a glittery cowgirl hat 24\/7.The  Resist  movement includes Wilson who refused to go to Trump s inauguration. Wilson also attacked the president in May when she said said he  needs psychological help and is desperate for attention.  Perhaps Cowgirl Wilson should look in the mirror .According to left leaning propaganda news NBC: He said,  But you know he must ve known what he signed up for,  the Democrat recounted Trump saying more than once during the call to express his sympathy. According to Wilson, the conversation lasted somewhere from three to five minutes. Everyone knows when you go to war you could possibly not come back alive but you don t remind a grieving widow of that,  Wilson said.  That s so insensitive. Trump  didn t even remember his name,  Wilson recalled Myeshia Johnson telling her after the call ended, the congresswoman told MSNBC s  Morning Joe  Wednesday. She hung up the phone and said,  He didn t even remember his name,  Wilson said.  That s the hurting part. The White House said Tuesday that the president had called the families of all four service members who were killed.  He offered condolences on behalf of a grateful nation and assured them their family s extraordinary sacrifice to the country will never be forgotten,  the White House said.Asked about Wilson s characterization of the call, a White House official said Tuesday night that  the president s conversations with the families of American heroes who have made the ultimate sacrifice are private. PETE HEGSETH POINTED OUT THAT THIS IS HOW FAR THE LEFT WILL GO TO TRASH TRUMP:Pete Hegseth said on  Fox & Friends  that this is another example of Trump s opponents taking every opportunity to twist or spin his words, even if it involves a fallen soldier. They want to question at every turn what he says he s committed to,  Hegseth said.  There s no one more committed, I believe, to our service members, to our veterans than this president. He said this shows how committed Democrats are to resisting Trump no matter what.TRUMP HITS BACK:Trump hit back at the claims saying he has proof of what was said on the call:Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!  Donald J. Trump (@realDonaldTrump) October 18, 2017Wilson took no time in shooting back that Trump is a  sick man . She s clearly milking this for all it s worth. It s sick that this Democrat would use this call to a grieving widow to bash our president.","subject":"left-news","date":"Oct 18, 2017"},{"title":"MEDIA DOWNPLAYS Attack By Unhinged Neighbor On Senator Rand Paul…’Minor Injuries’ Not So Minor","text":"5 broken ribs with trouble breathing, lung contusions and life-threatening possibilities is not a  minor injury  as media claimed A senior adviser for Rand Paul says the U.S. senator is recovering from five broken ribs following an assault at his home.Doug Stafford said it is unclear when Paul will return to work since he is in considerable pain and has difficulty getting around, including flying. Stafford said Sunday that the broken ribs include three displaced fractures, which can lead to life-threatening injuries. The severe pain can last for weeks or months.Police arrested 59-year-old Rene Boucher on Saturday and charged him with misdemeanor fourth-degree assault with a minor injury. Boucher is accused of attacking Paul on Friday, but officials have not released a motive.Boucher lives next door to Paul and his wife, according to Warren County property records.Boucher was released from jail on Saturday. He has not returned a call seeking comment.OUR PREVIOUS REPORT ON THE ATTACK:Another unhinged Democrat has been arrested for attacking someone with political views that are in opposition to his yawn Kentucky State Police have arrested a person accused of assaulting Sen. Rand Paul (R-Ky.) at his home in Kentucky, the senator s office confirmed on Saturday. Senator Paul was blindsided and the victim of an assault,  Kelsey Cooper, a spokeswoman for Paul, said in a statement.  The assailant was arrested and it is now a matter for the police. Senator Paul is fine. The suspect was identified as 59-year-old Rene Boucher of Bowling Green, Kent., according to a statement from Kentucky State Police reported by the Bowling Green Daily News.  True PunditBoucher is an anesthesiologist and pain specialist. He got his medical degree from Des Moines University College of Osteopathic Medicine after being pre-med at Providence College in Rhode Island, according to Doximity. Boucher has practiced medicine in since 1982 and attended high school in New Bedford, Massachusetts. Between 1985 and 1993, Boucher was pain management specialist at the Letterman Army Medical Center in San Francisco where he also did his residency.In 2005, Boucher appeared on QVC marketing a rice-filled vest that was designed to alleviate back pain, reported the Bowling Green Daily News. The vest retailed at $30 and had to be microwaved before use. The website for Therm-a-Vest is no longer active. WAVE reports that Boucher retired in 2015.In May 2017, Boucher shared a story on Facebook about Republican Congressman Greg Gianforte assaulting The Guardian s Ben Jacobs in Bozeman, Montana. The assault was described as a  body slam  at the time. Boucher writes in his Facebook bio that he is in a relationship. The Bowling Green Daily News article about Boucher s pain relieving vest saw him city his wife, Lisa, as a reason for its success.Boucher is a registered Democrat. Since Trump s ascendency to the president, Boucher has been severely critical the GOP on Facebook. Boucher is shown to be an advocate for gun control and healthcare reform. There does not seem to be any posts that target Senator Paul.   Heavy ","subject":"politics","date":"Nov 6, 2017"},{"title":" Why This Attorney General Is Going After Trump For ‘Fraud’","text":"New York Attorney General Eric Schneiderman isn t going to allow Donald Trump s 2016 presidential campaign get in the way of his ongoing prosecution of the GOP frontrunner for  fraud. Schneiderman is the highest profile government official looking into Trump s shady business dealings at Trump University. Customers claim that after they signed up for the opportunity, they were pressured to spend ever-increasing amounts of money with little knowledge of the real estate business to show for it.In an interview with ABC, the attorney general explained that he s not going to back off. We re ready to go,  Schneiderman, a Democrat, told ABC News today.  We sued him long before anyone thought he might run for President. This is not a political case, it s just a straight-up fraud case. Like the judge also looking into the case, Scneiderman has come in for attack by Trump, who has used his high profile to impugn the prosecutor s motives. But that hasn t dissuaded the prosecutor.Schneiderman told ABC News he is not worrying about the confluence of the campaign and his case. The documents, he said only served to offer further proof that the operation was aimed less at teaching students the skills needed to buy and sell real state, and more about making money for Trump. It was clearly a way to separate people who were desperate to make money in hard economic times from their own cash and to get it into the pocket of Mr. Trump and his cronies,  Schneiderman said.The secret Trump University documents have revealed that workers at the operation were given a step-by-step manual on how to convince prospective  students  to give the company access to their money and also explained how to prey on their emotions in pursuit of profits. Trump University is now defunct, after Trump and his partners made money off of regular people, all while egging students on to profit from the 2007-8 real estate collapse.Featured image via YouTube","subject":"News","date":"May 31, 2016"}]