[{"text":"WASHINGTON - Republican Ted Cruz on Friday denounced an article in the National Enquirer tabloid claiming he had extramarital affairs as “complete and utter lies” and accused rival Donald Trump of being the source of the story. The story took the Republican presidential race to a new level of personal rancor and Trump issued a statement saying he was not responsible for it. “I have nothing to do with the National Enquirer and unlike Lyin’ Ted Cruz I do not surround myself with political hacks and henchman and then pretend total innocence,” Trump said. Cruz, a U.S. senator from Texas, addressed the Enquirer story at a news conference in Wisconsin, saying, “Let me be clear. This National Enquirer story is garbage. It is complete and utter lies. It’s tabloid smear and it is a smear that has come from Donald Trump and his henchmen.” Trump’s statement pointed to other articles the Enquirer, a tabloid known for its gossip and unflattering celebrity photos, had been correct about in the past. “Ted Cruz’s problem with the National Enquirer is his and his alone, and while they were right about O.J. Simpson, John Edwards, and many others, I certainly hope they are not right about Lyin’ Ted Cruz,” the billionaire New York developer said. Trump and Cruz have sparred in recent days about their wives as they battle to be the Republican nominee in the Nov. 8 election. Earlier this week Trump accused Cruz of posting a nude photo of Trump’s wife, Melania, on Twitter. Cruz denied having any role in the photo being circulated on the Internet and Trump responded by threatening to “spill the beans” on Cruz’s wife. Cruz said the Enquirer story was evidence that Trump is unfit to be president. “This man would be an embarrassment,” he said. The Enquirer published blurred images of five women with whom it said Cruz has had affairs but did not name them. Two women who appeared to be pictured in the Enquirer stepped forward on Friday and called the article false. The National Enquirer could not immediately be reached for comment on the story. Cruz’ wife, Heidi Cruz, was campaigning with him on Friday and he gave her a hug and kiss before he began a town hall event. She sat off stage smiling while he spoke. This is not the first time a presidential candidate has been accused of extramarital sex. During the 1992 campaign, Gennifer Flowers came forward to detail an affair she had with Bill Clinton. Subsequently, more women admitted to having affairs with him, including then-White House intern Monica Lewinsky. Former Colorado Senator Gary Hart, a Democrat, had his 1988 presidential campaign derailed when reports surfaced that he was having an affair. Former North Carolina Senator John Edwards admitted to having an affair with a campaign photographer during his 2004 campaign, although the public did not learn about the romance until after he was defeated. The Enquirer’s Cruz story exploded on the social media site Twitter overnight on Thursday. By Thursday afternoon, #CruzSexScandal was a worldwide trending topic on Twitter. ","actual_label":"true","predicted_label":"fake"},{"text":"Neil Gorsuch, President Donald Trump’s appointee to the U.S. Supreme Court who was confirmed by the Senate to the lifetime job on Friday in a 54-45 vote, will have an immediate impact on cases already pending before the justices. The nine-seat court has operated with only eight justices after the death of conservative Antonin Scalia on Feb. 13, 2016, with four liberals and four conservatives. Gorsuch’s confirmation restores a 5-4 conservative majority. The new justice could cast the deciding vote in new cases before the court as well as some cases already argued during the current term that ends in June. The court could decide to hear fresh arguments in cases in which they otherwise would be split 4-4. Here is a list of five such cases in which Gorsuch could be pivotal. Religious rights: Trinity Lutheran Church v. Comer A case from Missouri to be argued on April 19 in which a church contends the state violated the U.S. Constitution’s First Amendment guarantee of religious freedom by denying it funds for a playground project because of a state ban on aid to religious organizations. Employee class-action lawsuits: Epic Systems Corp v. Lewis A significant case for business and labor on whether companies can head off costly class-action lawsuits by forcing employees to give up their right to pursue work-related legal claims as a group in court. An issue that has divided the court in the past, this case is set to be argued in the next term, which starts in October. Housing discrimination: Bank of America v. Miami The eight-justice court appeared closely divided when it heard arguments on Nov. 8 on whether the city of Miami could pursue lawsuits accusing major banks of predatory mortgage lending to black and Hispanic home buyers. The court may need to reargue the case with Gorsuch on board to avoid a 4-4 split. Cross-border shooting: Hernandez v. Mesa A 4-4 split appeared possible when the court heard arguments in this civil rights case on Feb. 21. The court has been asked to revive a civil rights lawsuit filed by the family of a Mexican teenager against a U.S. Border Patrol agent who fatally shot the 15-year-old from across the border in Texas in 2010. Corporate liability: Jesner v. Arab Bank In a case to be heard next term, the court agreed on Monday to consider reviving litigation that seeks to hold Arab Bank Plc ARBK.AM financially liable for militant attacks in Israel and the Palestinian territories and accuses the Jordan-based bank of being the “paymaster” to militant groups. The question of whether companies can be held liable for actions overseas under a federal law called the Alien Tort Statute is one the court also took up in 2013 but failed to decide.  ","actual_label":"true","predicted_label":"fake"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to many countries in the Americas.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but the World Health Organization (WHO) had said early in 2016 that it would take at least 18 months to start large-scale clinical trials of potential preventative shots. A vaccine is not expected to be ready for widespread use for at least two or three years. U.S. government researchers said they started their first clinical trial of a Zika vaccine. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly and other severe brain abnormalities in babies. The CDC said now that the causal relationship has been established, several important questions must still be answered with studies that could take years. According to the World Health Organization, there is strong scientific consensus that Zika can cause the birth defect microcephaly in babies, a condition defined by unusually small heads that can result in developmental problems. In addition, the agency said it could cause Guillain-Barre syndrome, a rare neurological disorder that can result in paralysis. Conclusive proof of the damage caused by Zika may take months or years. Brazil reports the number of confirmed cases of microcephaly at more than 1,700 as doctors and Brazilian health officials find that some suspected cases of microcephaly are not the disorder. Suspected ones under investigation had declined to 3,257. Brazil registered 91,387 likely cases of the Zika virus from February until April 2. Current research in Brazil indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. The symptoms are similar to those of dengue or chikungunya, which are transmitted by the same type of mosquito. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries where they may be exposed to Zika. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 54 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (45): Anguilla, Antigua, Argentina, Aruba, Barbados, Barbuda, Belize, Bolivia, Bonaire, Brazil, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Saba, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, Saint Eustatius, St. Maarten, Suriname, Trinidad and Tobago, Turks and Cacos, U.S. Virgin Islands and Venezuela. Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa, and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  Can Zika be transmitted through sexual contact? The World Health Organization (WHO) said sexual transmission is “relatively common” and has advised pregnant women not to travel to areas with ongoing outbreaks of Zika virus. It also  advised women living in areas where the virus is being transmitted to delay getting pregnant. The U.S. CDC is investigating about a dozen cases of possible sexual transmission. Those cases involved possible transmission of the virus from men to their sex partners. But the CDC issued updated recommendations for preventing and testing for Zika infection on July 25, warning that the virus can be transmitted through unprotected sex with an infected female partner. A reported case of female-to-male sexual transmission in New York City, and limited human and non-human primate data indicating that Zika virus RNA can be detected in vaginal secretions, led to the new warning, the agency said. CDC’s expanded warnings on sexual exposure to Zika now  caution against sex without a condom or other barrier method of protection with any person, male or female, who has traveled to or lives in an area with Zika, including female to female transmission with a pregnant partner. British health officials reported Zika was found in a man’s semen two months after he was infected, suggesting the virus may linger in semen long after infection symptoms fade. The PAHO said Zika can be transmitted through blood, but this is an infrequent transmission mechanism. There is no evidence Zika can be transmitted to babies through breast milk. The WHO has identified Zika cases in Argentina, Chile, France, Italy and New Zealand as likely caused by sexual transmission.  What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","actual_label":"true","predicted_label":"fake"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to many countries in the Americas.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but the World Health Organization (WHO) had said it would take at least 18 months to start large-scale clinical trials of potential preventative shots. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly and other severe brain abnormalities in babies. The CDC said now that the causal relationship has been established, several important questions must still be answered with studies that could take years. According to the World Health Organization, there is strong scientific consensus that Zika can cause the birth defect microcephaly in babies, a condition defined by unusually small heads that can result in developmental problems. In addition, the agency said it could cause Guillain-Barre syndrome, a rare neurological disorder that can result in paralysis. Conclusive proof of the damage caused by Zika may take months or years. Brazil reports the number of confirmed cases of microcephaly at 1,434 through May 21 as doctors and Brazilian health officials find that some suspected cases of microcephaly are not the disorder. Suspected ones under investigation declined to 3,257. Colombia confirmed two cases of microcephaly linked to Zika. Brazil registered 91,387 likely cases of the Zika virus from February until April 2. Current research in Brazil indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. The symptoms are similar to those of dengue or chikungunya, which are transmitted by the same type of mosquito. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries where they may be exposed to Zika. Cases of sexual transmission have also been reported, prompting health officials to advise use of condoms, or abstaining from sex, to prevent infection between partners. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 48 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (39): Argentina, Aruba, Barbados, Belize, Bolivia, Bonaire, Brazil, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, St. Maarten, Suriname, Trinidad and Tobago, U.S. Virgin Islands and Venezuela Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa, and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  Can Zika be transmitted through sexual contact? The World Health Organization (WHO) said sexual transmission is “relatively common” and has advised pregnant women not to travel to areas with ongoing outbreaks of Zika virus. It also  advised women living in areas where the virus is being transmitted to delay getting pregnant. The U.S. CDC is investigating about a dozen cases of possible sexual transmission. All cases involve possible transmission of the virus from men to their sex partners. The WHO has also identified Zika cases in Argentina, Chile, France, Italy and New Zealand as likely caused by sexual transmission.  British health officials reported Zika was found in a man’s semen two months after he was infected, suggesting the virus may linger in semen long after infection symptoms fade. The PAHO said Zika can be transmitted through blood, but this is an infrequent transmission mechanism. There is no evidence Zika can be transmitted to babies through breast milk. What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","actual_label":"true","predicted_label":"fake"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to almost 60 countries.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes aegypti mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. The virus can also be transmitted through sex, from either a male or female partner who has been infected, and a few cases of apparent infection via blood transfusion have been reported. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but a preventative shot is not expected to be ready for widespread use for at least two or three years. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly, a condition defined by unusually small heads that can result in developmental problems, and other severe brain abnormalities in babies. The CDC said that since the causal relationship had been established, several important questions must still be answered with studies that could take years. The World Health Organization in an updated assessment said the “most likely explanation” is that Zika virus infection during pregnancy is a cause of congenital brain abnormalities including microcephaly. In addition, the agency said infection is a trigger of Guillain-Barre syndrome (GBS), a rare neurological disorder that can result in paralysis. The update from the WHO came after considering months of research. Its previous statement, based on a rapid assessment of evidence, said there was strong scientific consensus that Zika virus caused GBS, microcephaly and other neurological disorders. Brazil recently reported 1,835 confirmed cases of microcephaly believed to be linked to Zika infections in pregnant women. It is investigating more than 3,200 suspected cases of microcephaly. Current research indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries, sections of Miami, Florida in the United States and Singapore where they may be exposed to Zika. They are also advising that men and women who have traveled to Zika outbreak areas use condoms or abstain from sex for six months to prevent sexual transmission of the virus. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 58 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (48): Anguilla, Antigua and Barbuda, Argentina, Aruba, The Bahamas, Barbados, Belize, Bolivia, Bonaire, Brazil, British Virgin Islands, Cayman Islands, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Saba, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, Saint Eustatius, St. Maarten, Suriname, Trinidad and Tobago, Turks and Caicos, United States, U.S. Virgin Islands and Venezuela. Asia (1): Singapore Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","actual_label":"true","predicted_label":"fake"},{"text":" Reuters is reporting: U.S. President Donald Trump on Friday granted a pardon to former Arizona lawman and political ally Joe Arpaio, the self-proclaimed  toughest sheriff in America,  less than a month after he was convicted of criminal contempt in a case involving his department s racial profiling policy.Trump had signaled this week that the first presidential pardon of his administration would go to Arpaio, 85, whom he has frequently praised for his hardline immigration stance.Here s a hint from President Trump during his speech this past week in Phoenix: I think he s going to be just fine    President TrumpSTATEMENT FROM THE WHITE HOUSE:BREAKING: President Trump pardons former Arizona sheriff Joe Arpaio pic.twitter.com\/P56QQ3agmy  Josh Caplan (@joshdcaplan) August 26, 2017","actual_label":"fake","predicted_label":"true"},{"text":"It’s the near future, and North Korea’s regime is on the brink of collapse. As rumors swirl of palace coups, forces on both sides of the world’s most militarized border are on heightened alert. The U.S. military faces a much bigger problem. Somewhere in the Pacific, a North Korean submarine is believed to be carrying nuclear warheads and the missiles to deliver them. And nobody knows where it is.  It sounds like the plot of a “Hunt for Red October”-style technothriller. But if Pyongyang’s technicians continue at their current pace, experts say it is becoming ever more likely.  One thing is certain: North Korea is plowing considerable resources into building its nuclear capability. And it is clearly making progress – even if Tuesday’s failed missile test shows it still has a long way to go.  Japanese officials said what appeared to be a conventional Musudan rocket, which theoretically has the ability to reach Japan and the U.S. territory and military base of Guam, exploded either as or shortly after it left its launcher. North Korea is estimated to have some 20 to 30 of the missiles – first deployed in 2007, but yet to be launched successfully.  What North Korean leader Kim Jong Un wants, most analysts believe, is simple – a rocket that can fire a nuclear warhead at least to regional targets. His ultimate ambition, however, is to be able to hit U.S. cities on the West Coast, most likely from a submarine that could hide itself at sea.  North Korea has been steadily improving its rockets – which can also carry conventional explosives – for decades. It detonated its first nuclear device in 2006 but most experts believe it has yet to build one small enough to be placed on a missile. Having the credible ability to do all of that and get the missiles to sea could take well over a decade, perhaps considerably more.  Once it happens, however, it will be a strategic game changer. At worst, U.S. cities on the West Coast would have to deal with the prospect, however remote, that they might be struck by a North Korean atomic weapon. At the very least, a North Korea armed with nuclear submarines would hugely complicate the calculus for any U.S. president handling a crisis on the Korean peninsula itself.  That, of course, is exactly the plan.  The fact that Pyongyang has conducted so many tests this year, some experts believe, suggests Kim is pushing his scientists harder than ever to deliver working rockets and warheads. North Korea is believed to have tagged the expertise of Russian Cold War-era scientists, and while its capabilities on both fronts lag well behind established nuclear states such as Russia and China, it is already believed to be well ahead of Iran.  In April, South Korean and U.S. officials said a North Korean submarine successfully launched a ballistic missile that traveled some 18 miles — a major step forward.  Technical experts say TV footage appeared to show a solid fuel rocket successfully launching from underwater, essentially the same system used by Western forces to achieve the same goal.  When she testified before the Senate Armed Services Committee in April, the incoming head of the U.S. Northern Command – responsible for defending the mainland United States – delivered a stark warning.  “The North Korean threat is real,” U.S. Air Force General Lori Robinson – previously head of U.S. air forces in the Pacific – told lawmakers. “For now, it’s a medium range but they are trying very hard to be able to hit the homeland.”  It’s impossible to know exactly how much money and expertise the North Koreans are expending. The scale of the effort, however, is seen as large – in many ways, the same level of commitment the United States gave to the Manhattan Project to build the world’s first atomic bomb during World War Two. Pyongyang’s reason is clear: building that kind of credible ability to strike is seen as central to the long-term survival of the Kim dynasty and its ruling party.  Earlier this month, at the first meeting of its ruling party in 36 years, Kim said North Korea was a responsible nuclear weapons state and would never use its weapons – unless it were threatened. That seemed a clear warning to outside powers, particularly Washington, to steer clear of any attempts to destabilize or attack the regime.  Getting a submarine-based deterrent would be a very big deal – and not just because it might allow the North Koreans to move the launch point much closer to the target. Submarines are central to what nuclear weapons states call a “second strike” capability, the ability to launch missiles even in the aftermath of an overwhelming and perhaps surprise preemptive attack.  The United States, Russia, Britain and France all retain what they call a “continuous at sea deterrent,” at least one submarine offshore at all times ready to fight back even if the homeland and all other military forces are completely taken out. Israel is also believed to have the ability to mount nuclear cruise missiles on its Dolphin-class conventional submarines, while China is now moving quickly towards new ballistic missile submarines for its own at sea deterrent.  This technology isn’t new – the United States and Russia developed it in the late 1950s based in part on plans originally developed to hit Nazi German U-boats in the dying days of World War Two. There is no good reason it should not eventually work for North Korea, too.  If and when it does, Pyongyang is likely to try to keep its submarines very close to its coasts—and its home defenses—at first. Still, once the first nuclear-armed submarine exists, Japan and the United States might feel political pressure to destroy it.  That would come with considerable risks. The North is known to have huge volumes of conventional artillery based along the South Korean border, much of it in range of Seoul and its 10 million residents. The risk of those weapons inflicting massive casualties is one of the key factors that has deterred multiple U.S. administrations from considering the kind of preemptive strike on Pyongyang’s weapons programs that the United States has threatened against Iran.  The Korean War – frozen by its 1953 cease-fire but never otherwise resolved – may not be over yet.  ","actual_label":"true","predicted_label":"fake"},{"text":"WASHINGTON - U.S. President Barack Obama on Saturday laid out a plan to help support the income of workers who lose their jobs and end up in lower paying positions, as part of a push to get unemployed Americans back to work. The proposal would offer experienced workers who now make less than $50,000 a form of wage insurance, allowing them to replace half of their lost pay. The benefit would cover up to $10,000 over two years. “It’s a way to give families some stability and encourage folks to rejoin the workforce - because we shouldn’t just be talking about unemployment; we should be talking about re-employment,” Obama said in his weekly radio and Internet address, broadcast on Saturday. The wage insurance proposal will be included in a broader effort to overhaul the unemployment insurance system. Details about the program’s proposed funding will be further outlined in Obama’s budget for fiscal year 2017 expected to be released next month. Obama promised in his State of the Union earlier this week to advocate for legislative action on issues with bipartisan support during his last year in office. During the address, he pointed to wage insurance as one measure where lawmakers may be able to work together. The White House plan would require states to provide insurance for workers laid off from jobs they had held for at least three years. The plan would be federally-funded, but it would be administered through state unemployment insurance programs. Other measures proposed by the White House on Saturday included a requirement that all states provide at least 26 weeks of unemployment insurance benefits, and the creation of a permanent program that would automatically provide up to 52 additional weeks of federally-funded benefits for states experiencing rapid job-losses or high unemployment.       ","actual_label":"true","predicted_label":"fake"}]