[{"text":"WASHINGTON - Republican Ted Cruz on Friday denounced an article in the National Enquirer tabloid claiming he had extramarital affairs as “complete and utter lies” and accused rival Donald Trump of being the source of the story. The story took the Republican presidential race to a new level of personal rancor and Trump issued a statement saying he was not responsible for it. “I have nothing to do with the National Enquirer and unlike Lyin’ Ted Cruz I do not surround myself with political hacks and henchman and then pretend total innocence,” Trump said. Cruz, a U.S. senator from Texas, addressed the Enquirer story at a news conference in Wisconsin, saying, “Let me be clear. This National Enquirer story is garbage. It is complete and utter lies. It’s tabloid smear and it is a smear that has come from Donald Trump and his henchmen.” Trump’s statement pointed to other articles the Enquirer, a tabloid known for its gossip and unflattering celebrity photos, had been correct about in the past. “Ted Cruz’s problem with the National Enquirer is his and his alone, and while they were right about O.J. Simpson, John Edwards, and many others, I certainly hope they are not right about Lyin’ Ted Cruz,” the billionaire New York developer said. Trump and Cruz have sparred in recent days about their wives as they battle to be the Republican nominee in the Nov. 8 election. Earlier this week Trump accused Cruz of posting a nude photo of Trump’s wife, Melania, on Twitter. Cruz denied having any role in the photo being circulated on the Internet and Trump responded by threatening to “spill the beans” on Cruz’s wife. Cruz said the Enquirer story was evidence that Trump is unfit to be president. “This man would be an embarrassment,” he said. The Enquirer published blurred images of five women with whom it said Cruz has had affairs but did not name them. Two women who appeared to be pictured in the Enquirer stepped forward on Friday and called the article false. The National Enquirer could not immediately be reached for comment on the story. Cruz’ wife, Heidi Cruz, was campaigning with him on Friday and he gave her a hug and kiss before he began a town hall event. She sat off stage smiling while he spoke. This is not the first time a presidential candidate has been accused of extramarital sex. During the 1992 campaign, Gennifer Flowers came forward to detail an affair she had with Bill Clinton. Subsequently, more women admitted to having affairs with him, including then-White House intern Monica Lewinsky. Former Colorado Senator Gary Hart, a Democrat, had his 1988 presidential campaign derailed when reports surfaced that he was having an affair. Former North Carolina Senator John Edwards admitted to having an affair with a campaign photographer during his 2004 campaign, although the public did not learn about the romance until after he was defeated. The Enquirer’s Cruz story exploded on the social media site Twitter overnight on Thursday. By Thursday afternoon, #CruzSexScandal was a worldwide trending topic on Twitter. ","label":"true","predicted_label":"fake"},{"text":"Neil Gorsuch, President Donald Trump’s appointee to the U.S. Supreme Court who was confirmed by the Senate to the lifetime job on Friday in a 54-45 vote, will have an immediate impact on cases already pending before the justices. The nine-seat court has operated with only eight justices after the death of conservative Antonin Scalia on Feb. 13, 2016, with four liberals and four conservatives. Gorsuch’s confirmation restores a 5-4 conservative majority. The new justice could cast the deciding vote in new cases before the court as well as some cases already argued during the current term that ends in June. The court could decide to hear fresh arguments in cases in which they otherwise would be split 4-4. Here is a list of five such cases in which Gorsuch could be pivotal. Religious rights: Trinity Lutheran Church v. Comer A case from Missouri to be argued on April 19 in which a church contends the state violated the U.S. Constitution’s First Amendment guarantee of religious freedom by denying it funds for a playground project because of a state ban on aid to religious organizations. Employee class-action lawsuits: Epic Systems Corp v. Lewis A significant case for business and labor on whether companies can head off costly class-action lawsuits by forcing employees to give up their right to pursue work-related legal claims as a group in court. An issue that has divided the court in the past, this case is set to be argued in the next term, which starts in October. Housing discrimination: Bank of America v. Miami The eight-justice court appeared closely divided when it heard arguments on Nov. 8 on whether the city of Miami could pursue lawsuits accusing major banks of predatory mortgage lending to black and Hispanic home buyers. The court may need to reargue the case with Gorsuch on board to avoid a 4-4 split. Cross-border shooting: Hernandez v. Mesa A 4-4 split appeared possible when the court heard arguments in this civil rights case on Feb. 21. The court has been asked to revive a civil rights lawsuit filed by the family of a Mexican teenager against a U.S. Border Patrol agent who fatally shot the 15-year-old from across the border in Texas in 2010. Corporate liability: Jesner v. Arab Bank In a case to be heard next term, the court agreed on Monday to consider reviving litigation that seeks to hold Arab Bank Plc ARBK.AM financially liable for militant attacks in Israel and the Palestinian territories and accuses the Jordan-based bank of being the “paymaster” to militant groups. The question of whether companies can be held liable for actions overseas under a federal law called the Alien Tort Statute is one the court also took up in 2013 but failed to decide.  ","label":"true","predicted_label":"fake"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to many countries in the Americas.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but the World Health Organization (WHO) had said early in 2016 that it would take at least 18 months to start large-scale clinical trials of potential preventative shots. A vaccine is not expected to be ready for widespread use for at least two or three years. U.S. government researchers said they started their first clinical trial of a Zika vaccine. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly and other severe brain abnormalities in babies. The CDC said now that the causal relationship has been established, several important questions must still be answered with studies that could take years. According to the World Health Organization, there is strong scientific consensus that Zika can cause the birth defect microcephaly in babies, a condition defined by unusually small heads that can result in developmental problems. In addition, the agency said it could cause Guillain-Barre syndrome, a rare neurological disorder that can result in paralysis. Conclusive proof of the damage caused by Zika may take months or years. Brazil reports the number of confirmed cases of microcephaly at more than 1,700 as doctors and Brazilian health officials find that some suspected cases of microcephaly are not the disorder. Suspected ones under investigation had declined to 3,257. Brazil registered 91,387 likely cases of the Zika virus from February until April 2. Current research in Brazil indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. The symptoms are similar to those of dengue or chikungunya, which are transmitted by the same type of mosquito. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries where they may be exposed to Zika. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 54 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (45): Anguilla, Antigua, Argentina, Aruba, Barbados, Barbuda, Belize, Bolivia, Bonaire, Brazil, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Saba, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, Saint Eustatius, St. Maarten, Suriname, Trinidad and Tobago, Turks and Cacos, U.S. Virgin Islands and Venezuela. Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa, and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  Can Zika be transmitted through sexual contact? The World Health Organization (WHO) said sexual transmission is “relatively common” and has advised pregnant women not to travel to areas with ongoing outbreaks of Zika virus. It also  advised women living in areas where the virus is being transmitted to delay getting pregnant. The U.S. CDC is investigating about a dozen cases of possible sexual transmission. Those cases involved possible transmission of the virus from men to their sex partners. But the CDC issued updated recommendations for preventing and testing for Zika infection on July 25, warning that the virus can be transmitted through unprotected sex with an infected female partner. A reported case of female-to-male sexual transmission in New York City, and limited human and non-human primate data indicating that Zika virus RNA can be detected in vaginal secretions, led to the new warning, the agency said. CDC’s expanded warnings on sexual exposure to Zika now  caution against sex without a condom or other barrier method of protection with any person, male or female, who has traveled to or lives in an area with Zika, including female to female transmission with a pregnant partner. British health officials reported Zika was found in a man’s semen two months after he was infected, suggesting the virus may linger in semen long after infection symptoms fade. The PAHO said Zika can be transmitted through blood, but this is an infrequent transmission mechanism. There is no evidence Zika can be transmitted to babies through breast milk. The WHO has identified Zika cases in Argentina, Chile, France, Italy and New Zealand as likely caused by sexual transmission.  What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","label":"true","predicted_label":"true"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to many countries in the Americas.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but the World Health Organization (WHO) had said it would take at least 18 months to start large-scale clinical trials of potential preventative shots. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly and other severe brain abnormalities in babies. The CDC said now that the causal relationship has been established, several important questions must still be answered with studies that could take years. According to the World Health Organization, there is strong scientific consensus that Zika can cause the birth defect microcephaly in babies, a condition defined by unusually small heads that can result in developmental problems. In addition, the agency said it could cause Guillain-Barre syndrome, a rare neurological disorder that can result in paralysis. Conclusive proof of the damage caused by Zika may take months or years. Brazil reports the number of confirmed cases of microcephaly at 1,434 through May 21 as doctors and Brazilian health officials find that some suspected cases of microcephaly are not the disorder. Suspected ones under investigation declined to 3,257. Colombia confirmed two cases of microcephaly linked to Zika. Brazil registered 91,387 likely cases of the Zika virus from February until April 2. Current research in Brazil indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. The symptoms are similar to those of dengue or chikungunya, which are transmitted by the same type of mosquito. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries where they may be exposed to Zika. Cases of sexual transmission have also been reported, prompting health officials to advise use of condoms, or abstaining from sex, to prevent infection between partners. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 48 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (39): Argentina, Aruba, Barbados, Belize, Bolivia, Bonaire, Brazil, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, St. Maarten, Suriname, Trinidad and Tobago, U.S. Virgin Islands and Venezuela Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa, and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  Can Zika be transmitted through sexual contact? The World Health Organization (WHO) said sexual transmission is “relatively common” and has advised pregnant women not to travel to areas with ongoing outbreaks of Zika virus. It also  advised women living in areas where the virus is being transmitted to delay getting pregnant. The U.S. CDC is investigating about a dozen cases of possible sexual transmission. All cases involve possible transmission of the virus from men to their sex partners. The WHO has also identified Zika cases in Argentina, Chile, France, Italy and New Zealand as likely caused by sexual transmission.  British health officials reported Zika was found in a man’s semen two months after he was infected, suggesting the virus may linger in semen long after infection symptoms fade. The PAHO said Zika can be transmitted through blood, but this is an infrequent transmission mechanism. There is no evidence Zika can be transmitted to babies through breast milk. What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","label":"true","predicted_label":"true"},{"text":"Global health officials are racing to better understand the Zika virus behind a major outbreak that began in Brazil last year and has spread to almost 60 countries.  The following are some questions and answers about the virus and current outbreak: How do people become infected? Zika is transmitted to people through the bite of infected female mosquitoes, primarily the Aedes aegypti mosquito, the same type that spreads dengue, chikungunya and yellow fever. The Pan American Health Organization (PAHO) said Aedes aegypti mosquitoes are found in all countries in the Americas except Canada and continental Chile, and the virus will likely reach all countries and territories of the region where Aedes mosquitoes are found. The virus can also be transmitted through sex, from either a male or female partner who has been infected, and a few cases of apparent infection via blood transfusion have been reported. How do you treat Zika? There is no treatment or vaccine for Zika infection. Companies and scientists are racing to develop a safe and effective vaccine for Zika, but a preventative shot is not expected to be ready for widespread use for at least two or three years. How dangerous is it? The U.S. Centers for Disease Control and Prevention concluded that infection with the Zika virus in pregnant women is a cause of the birth defect microcephaly, a condition defined by unusually small heads that can result in developmental problems, and other severe brain abnormalities in babies. The CDC said that since the causal relationship had been established, several important questions must still be answered with studies that could take years. The World Health Organization in an updated assessment said the “most likely explanation” is that Zika virus infection during pregnancy is a cause of congenital brain abnormalities including microcephaly. In addition, the agency said infection is a trigger of Guillain-Barre syndrome (GBS), a rare neurological disorder that can result in paralysis. The update from the WHO came after considering months of research. Its previous statement, based on a rapid assessment of evidence, said there was strong scientific consensus that Zika virus caused GBS, microcephaly and other neurological disorders. Brazil recently reported 1,835 confirmed cases of microcephaly believed to be linked to Zika infections in pregnant women. It is investigating more than 3,200 suspected cases of microcephaly. Current research indicates the greatest microcephaly risk is associated with infection during the first trimester of pregnancy, but health officials have warned an impact could be seen in later weeks. Recent studies have shown evidence of Zika in amniotic fluid, placenta and fetal brain tissue. What are the symptoms of Zika infection?     People infected with Zika may have a mild fever, skin rash, conjunctivitis, muscle and joint pain and fatigue that can last for two to seven days. But as many as 80 percent of people infected never develop symptoms. How can Zika be contained? Efforts to control the spread of the virus focus on eliminating mosquito breeding sites and taking precautions against mosquito bites such as using insect repellent and mosquito nets. U.S. and international health officials have advised pregnant women to avoid travel to Latin American and Caribbean countries, sections of Miami, Florida in the United States and Singapore where they may be exposed to Zika. They are also advising that men and women who have traveled to Zika outbreak areas use condoms or abstain from sex for six months to prevent sexual transmission of the virus. How widespread is the outbreak? Active Zika outbreaks have been reported in at least 58 countries or territories, most of them in the Americas, according to the U.S. Centers for Disease Control and Prevention (CDC). Brazil has been the country most affected. (1.usa.gov\/1ovAJyh) Africa (1): Cape Verde  Americas (48): Anguilla, Antigua and Barbuda, Argentina, Aruba, The Bahamas, Barbados, Belize, Bolivia, Bonaire, Brazil, British Virgin Islands, Cayman Islands, Colombia, Costa Rica, Cuba, Curaçao, Dominica, Dominican Republic, Ecuador, El Salvador, French Guiana, Grenada, Guadeloupe, Guatemala, Guyana, Haiti, Honduras, Jamaica, Martinique, Mexico, Nicaragua, Panama, Paraguay, Peru, Saba, Puerto Rico, Saint Barthelmy, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, Saint Eustatius, St. Maarten, Suriname, Trinidad and Tobago, Turks and Caicos, United States, U.S. Virgin Islands and Venezuela. Asia (1): Singapore Oceania\/Pacific Islands (8): American Samoa, Fiji, Kosrae, Federated States of Micronesia, Marshall Islands, New Caledonia, Papua New Guinea, Samoa and Tonga.  What is the history of the Zika virus? The Zika virus is found in tropical locales with large mosquito populations. Outbreaks of Zika have been recorded in Africa, the Americas, Southern Asia and the Western Pacific. The virus was first identified in Uganda in 1947 in rhesus monkeys and was first identified in people in 1952 in Uganda and Tanzania, according to the WHO.  What other complications are associated with Zika? Zika has also been associated with other neurological disorders, including serious brain and spinal cord infections. The long-term health consequences of Zika infection are unclear. Other uncertainties surround the incubation period of the virus and how Zika interacts with other viruses that are transmitted by mosquitoes, such as dengue. ","label":"true","predicted_label":"fake"},{"text":" Reuters is reporting: U.S. President Donald Trump on Friday granted a pardon to former Arizona lawman and political ally Joe Arpaio, the self-proclaimed  toughest sheriff in America,  less than a month after he was convicted of criminal contempt in a case involving his department s racial profiling policy.Trump had signaled this week that the first presidential pardon of his administration would go to Arpaio, 85, whom he has frequently praised for his hardline immigration stance.Here s a hint from President Trump during his speech this past week in Phoenix: I think he s going to be just fine    President TrumpSTATEMENT FROM THE WHITE HOUSE:BREAKING: President Trump pardons former Arizona sheriff Joe Arpaio pic.twitter.com\/P56QQ3agmy  Josh Caplan (@joshdcaplan) August 26, 2017","label":"fake","predicted_label":"true"},{"text":"It’s the near future, and North Korea’s regime is on the brink of collapse. As rumors swirl of palace coups, forces on both sides of the world’s most militarized border are on heightened alert. The U.S. military faces a much bigger problem. Somewhere in the Pacific, a North Korean submarine is believed to be carrying nuclear warheads and the missiles to deliver them. And nobody knows where it is.  It sounds like the plot of a “Hunt for Red October”-style technothriller. But if Pyongyang’s technicians continue at their current pace, experts say it is becoming ever more likely.  One thing is certain: North Korea is plowing considerable resources into building its nuclear capability. And it is clearly making progress – even if Tuesday’s failed missile test shows it still has a long way to go.  Japanese officials said what appeared to be a conventional Musudan rocket, which theoretically has the ability to reach Japan and the U.S. territory and military base of Guam, exploded either as or shortly after it left its launcher. North Korea is estimated to have some 20 to 30 of the missiles – first deployed in 2007, but yet to be launched successfully.  What North Korean leader Kim Jong Un wants, most analysts believe, is simple – a rocket that can fire a nuclear warhead at least to regional targets. His ultimate ambition, however, is to be able to hit U.S. cities on the West Coast, most likely from a submarine that could hide itself at sea.  North Korea has been steadily improving its rockets – which can also carry conventional explosives – for decades. It detonated its first nuclear device in 2006 but most experts believe it has yet to build one small enough to be placed on a missile. Having the credible ability to do all of that and get the missiles to sea could take well over a decade, perhaps considerably more.  Once it happens, however, it will be a strategic game changer. At worst, U.S. cities on the West Coast would have to deal with the prospect, however remote, that they might be struck by a North Korean atomic weapon. At the very least, a North Korea armed with nuclear submarines would hugely complicate the calculus for any U.S. president handling a crisis on the Korean peninsula itself.  That, of course, is exactly the plan.  The fact that Pyongyang has conducted so many tests this year, some experts believe, suggests Kim is pushing his scientists harder than ever to deliver working rockets and warheads. North Korea is believed to have tagged the expertise of Russian Cold War-era scientists, and while its capabilities on both fronts lag well behind established nuclear states such as Russia and China, it is already believed to be well ahead of Iran.  In April, South Korean and U.S. officials said a North Korean submarine successfully launched a ballistic missile that traveled some 18 miles — a major step forward.  Technical experts say TV footage appeared to show a solid fuel rocket successfully launching from underwater, essentially the same system used by Western forces to achieve the same goal.  When she testified before the Senate Armed Services Committee in April, the incoming head of the U.S. Northern Command – responsible for defending the mainland United States – delivered a stark warning.  “The North Korean threat is real,” U.S. Air Force General Lori Robinson – previously head of U.S. air forces in the Pacific – told lawmakers. “For now, it’s a medium range but they are trying very hard to be able to hit the homeland.”  It’s impossible to know exactly how much money and expertise the North Koreans are expending. The scale of the effort, however, is seen as large – in many ways, the same level of commitment the United States gave to the Manhattan Project to build the world’s first atomic bomb during World War Two. Pyongyang’s reason is clear: building that kind of credible ability to strike is seen as central to the long-term survival of the Kim dynasty and its ruling party.  Earlier this month, at the first meeting of its ruling party in 36 years, Kim said North Korea was a responsible nuclear weapons state and would never use its weapons – unless it were threatened. That seemed a clear warning to outside powers, particularly Washington, to steer clear of any attempts to destabilize or attack the regime.  Getting a submarine-based deterrent would be a very big deal – and not just because it might allow the North Koreans to move the launch point much closer to the target. Submarines are central to what nuclear weapons states call a “second strike” capability, the ability to launch missiles even in the aftermath of an overwhelming and perhaps surprise preemptive attack.  The United States, Russia, Britain and France all retain what they call a “continuous at sea deterrent,” at least one submarine offshore at all times ready to fight back even if the homeland and all other military forces are completely taken out. Israel is also believed to have the ability to mount nuclear cruise missiles on its Dolphin-class conventional submarines, while China is now moving quickly towards new ballistic missile submarines for its own at sea deterrent.  This technology isn’t new – the United States and Russia developed it in the late 1950s based in part on plans originally developed to hit Nazi German U-boats in the dying days of World War Two. There is no good reason it should not eventually work for North Korea, too.  If and when it does, Pyongyang is likely to try to keep its submarines very close to its coasts—and its home defenses—at first. Still, once the first nuclear-armed submarine exists, Japan and the United States might feel political pressure to destroy it.  That would come with considerable risks. The North is known to have huge volumes of conventional artillery based along the South Korean border, much of it in range of Seoul and its 10 million residents. The risk of those weapons inflicting massive casualties is one of the key factors that has deterred multiple U.S. administrations from considering the kind of preemptive strike on Pyongyang’s weapons programs that the United States has threatened against Iran.  The Korean War – frozen by its 1953 cease-fire but never otherwise resolved – may not be over yet.  ","label":"true","predicted_label":"fake"},{"text":"WASHINGTON - U.S. President Barack Obama on Saturday laid out a plan to help support the income of workers who lose their jobs and end up in lower paying positions, as part of a push to get unemployed Americans back to work. The proposal would offer experienced workers who now make less than $50,000 a form of wage insurance, allowing them to replace half of their lost pay. The benefit would cover up to $10,000 over two years. “It’s a way to give families some stability and encourage folks to rejoin the workforce - because we shouldn’t just be talking about unemployment; we should be talking about re-employment,” Obama said in his weekly radio and Internet address, broadcast on Saturday. The wage insurance proposal will be included in a broader effort to overhaul the unemployment insurance system. Details about the program’s proposed funding will be further outlined in Obama’s budget for fiscal year 2017 expected to be released next month. Obama promised in his State of the Union earlier this week to advocate for legislative action on issues with bipartisan support during his last year in office. During the address, he pointed to wage insurance as one measure where lawmakers may be able to work together. The White House plan would require states to provide insurance for workers laid off from jobs they had held for at least three years. The plan would be federally-funded, but it would be administered through state unemployment insurance programs. Other measures proposed by the White House on Saturday included a requirement that all states provide at least 26 weeks of unemployment insurance benefits, and the creation of a permanent program that would automatically provide up to 52 additional weeks of federally-funded benefits for states experiencing rapid job-losses or high unemployment.       ","label":"true","predicted_label":"fake"},
{"text":"The Senate voted 51-48 this afternoon to proceed to the resolution, S. Con. Res. 3, which would set up a filibuster-proof process, ensuring the chamber s consideration of legislation repealing parts of Obamacare and replacing it, either as one bill or as separate measures.The 54-page document, unveiled yesterday by Budget Chairman Mike Enzi, directs committees of jurisdiction to come up with Affordable Care Act legislation by Jan. 27, meaning a repeal bill could be to Donald Trump s desk by the end February, lawmakers said today.The House Ways and Means and Energy and Commerce as well as the Senate Finance and Health, Education, Labor, and Pensions committees are charged with drafting the legislation.Senate action came as Obama and Pence both headed to the Capitol to meet with their respective parties to discuss efforts to preserve or undo the health-care law. House Ways and Means Chairman Kevin Brady of Texas said that an Obamacare replacement proposal would be laid out on a step-by-step basis and could be fully written by the August recess.The Obama administration immediately hit back with the comment that the Senate vote was passed by a  pretty narrow margin Josh Earnest went on to say that the Republicans will be responsible for the ensuing chaos LOL! Via: ZH","label":"fake","predicted_label":"?"},{"text":"So much for the SCOTUS not being political Check out her comments on equality for women. It s like she s time traveled back to the 50 s. What is the deal with these women that think we re still in the dark ages!","label":"fake","predicted_label":"?"},{"text":"White House counselor Kellyanne Conway crawled out of her crypt after two weeks in hiding to attack Hillary Clinton who is totally not the President. Former reality show star Donald Trump was sworn in 216 days ago (seems longer, huh?) and his administration is still talking about his former rival. It s not too surprising since Trump is still in campaign mode, holding rallies, likely because he still doesn t know how to President.On Thursday, Conway appeared on  Fox & Friends  to lash out at Trump s critics, the media, and Hillary Clinton for daring to write a book because books are bad, apparently. Where s her big c4 trying to help women and children around the globe?  Conway asked as if the Clinton Foundation which helps women and children around the globe does not exist.Conway then just wondered why Clinton is not doing Trump s job. Where s her bipartisan effort to try to help with infrastructure and meaningful tax reform, or the opioid crisis that I work on in the building behind me every single day?  Conway asked.Trump s policies and attempted legislation have failed to pass. There s been an exodus of staffers at various councils after his appalling speech on the Charlottesville attack which left one dead and 19 others injured. Thanks, Hillary!Someone, please tell Trump that Hillary Clinton is not holding an elected office. Passing infrastructure bills and handling the opioid crisis is all on Trump. Eradicating Obamacare would have a devastating effect on those suffering from the disease of addiction who wish to get treatment. Thanks again, Hillary.Conway then claimed that Hillary Clinton  failed to make history,  even though she won the popular vote and was the first woman to become the presidential nominee of a major party in the U.S.Watch: It s way over the line.   @KellyannePolls reacts to James Clapper questioning Pres. Trump s fitness for office pic.twitter.com\/w4Db17t6g5  FOX & friends (@foxandfriends) August 24, 2017But Trump has tried to claim repeatedly that he won the popular vote (he did not win the popular vote) but thanks for weighing in, Kellyanne. Back to the crypt with you!Image via screen capture. ","label":"fake","predicted_label":"?"},{"text":"Donald Trump may have decided that Russia is going to be America s new BFF, but the rest of the GOP isn t so sure. Going against the incoming administration, several Republicans are preparing to launch a wide-ranging investigation into Russia, particularly their involvement with hacking and alleged interference in the presidential election.The Washington Post reported:Senate Armed Services Committee Chairman John McCain (Ariz.) is readying a probe of possible Russian cyber-incursions into U.S. weapons systems, and he said he has been discussing the issue with Senate Select Intelligence Committee Chairman Richard Burr (N.C.), with whom he will be  working closely  to investigate Russia s suspected interference in the U.S. elections and cyberthreats to the military and other institutions. Senate Majority Leader Mitch McConnell (R-Ky.) has been apprised of the discussions. Burr did not respond to requests for comment.Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.) also said he intends to hold hearings next year into alleged Russian hacking. Corker is on Trump s shortlist for secretary of state, according to the Trump transition team.Two of the most vocal voices on team Probe Putin are McCain and Sen. Lindsey Graham.Graham said that Russia will  keep doing more here until they pay a price.  Next year, he plans to head up legislation and hold investigative hearings on  Russia s misadventures throughout the world,  which will absolutely include Russian interference in the U.S. election. I m going after Russia in every way you can go after Russia. I think they re one of the most destabilizing influences on the world stage. I think they did interfere with our elections, and I want Putin personally to pay the price,  Graham told CNN on Wednesday.McCain said his Armed Services Committee is going to be investigating Russia s cyber capabilities and the extent that they could be used against the U.S. military and our weapons systems,  because the real threat is cyber.  McCain added that this investigation will probably veer off to include looking at the possibility Russia was behind the DNC hacking. Also on the list to be probed is the hacking of state-based election systems, including that of Arizona, McCain s home state. See, the problem with hacking is that if they re able to disrupt elections, then it s a national security issue, obviously,  McCain said on Thursday.He noted that the Armed Services Committee was  still formulating  just exactly how they would go about dealing with the issue, but said   there s very little doubt  that Russia was meddling in the U.S. election process, which he insists is very worthy of examination. Trump has dismissed the possibility that Russia was responsible for the DNC hacking, despite the fact that he himself called on the country to find  Hillary Clinton s missing emails. I don t believe they interfered,  Trump said.  It could be Russia. And it could be China. And it could be some guy in his home in New Jersey. I believe that it could have been Russia and it could have been any one of many other people. Sources or even individuals. Featured image via Joe Raedle\/Getty Images and Thierry Chesnot\/Getty Images. Images merged by Rika Christensen","label":"fake","predicted_label":"?"},{"text":"Have you ever wondered where a phrase started? How about the phrase  prime the pump?  It is widely considered to mean the use of government money to get a project going. While it dates back to the 1800s, President Donald Trump is now claiming that he invented the phrase. In reality, the use of the phrase  prime the pump  predates Trump s own birth by a hundred years, and the use of it in the current economic sense has existed since the 1930s.In a recent conversation with The Economist, this exchange happened (they were talking about Trump s tax plan):The Economist: But beyond that it s OK if the tax plan increases the deficit? Trump: It is OK, because it won t increase it for long. You may have two years where you ll you understand the expression  prime the pump ? The Economist: Yes. Trump: We have to prime the pump. The Economist: It s very Keynesian. Trump: We re the highest-taxed nation in the world. Have you heard that expression before, for this particular type of an event? The Economist: Priming the pump? Trump: Yeah, have you heard it? The Economist: Yes. Trump: Have you heard that expression used before? Because I haven t heard it. I mean, I just I came up with it a couple of days ago and I thought it was good. It s what you have to do.According to The Free Dictionary:Prime the Pump: Encourage the growth or action of something, as in  Marjorie tried to prime the pump by offering some new issues for discussion.  In the late 1800s this expression originally was used for pouring liquid into a pump to expel the air and make it work. In the 1930s it was applied to government efforts to stimulate the economy and thereafter was applied to other undertakings.It is hardly surprising that a) Trump had never heard this phrase, as it is rarely used on Twitter and b) he would take credit for it. In a week with so many gaffes, lies and just strange behavior, this may not be as big an issue but it s clear how little this man knows and how little he understands the world and reality that the rest of us live in. Another explanation could be that Trump is much, much older than we have been led to believe and has gone completely senile.Featured image via Photo by Joe Raedle\/Getty Images.","label":"fake","predicted_label":"?"},{"text":"While Donald Trump is currently freaking out because he hasn t been able to find anyone to perform at his inauguration (which is just a few short weeks away at this point), master chef Anthony Bourdain is making sure he rubs salt in Trump s open wounds.Never one to mince his words, Bourdain first asserted himself as an anti-Trump celebrity when he was asked if he d ever dine with Trump during his presidential campaign. Bourdain s reply was blunt and brutal   he said, Absolutely f*cking not. And Bourdain hasn t changed his tone about Trump, not even after the phony business mogul has been elected. In a recent interview with Eater s Helen Rosner, Bourdain further confirmed that he is as anti-Trump as ever. During the interview, Bourdain clearly stated that he was concerned about what Trump s presidency meant for his daughter   rightfully so, as any parent should be. But while Trump s presidency means horrible things for many people who aren t rich white men, Bourdain was able to find one silver lining.In stating that he would never attend Trump s White House Correspondents  dinner, Bourdain stated that at least Trump would probably put an end to it. He said: I doubt there will be another. Thank god, that s an institution I d like to see die for years. If there s one good thing to come out of the Trump administration, let it be that there will be no more White House Correspondents  dinners. It reinforces all the world s worst notions about the hideous, inside-the-beltway, all-in-it-together culture. It brings honor to no one to have Kim Kardashian or Tara Reid sitting there next to a news anchor. What is this all about? F*ck that. If I m gonna make fun of you today, I m not accepting your food tomorrow. I had dinner with President Obama, but I paid. We were offered Air Force One, and I said,  There s no way. No way. Well, he s probably right. Not only would there be several empty seats, but the only people who would actually attend would be swamp monsters just like Trump. This is surely going to be one sour reminder to Trump that he is extremely unpopular and will never be accepted in the way that President Barack Obama was embraced by most of America. You can read the rest of Bourdain s anti-Trump interview on Eater.Featured image via Astrid Stawiarz \/ Getty Images","label":"fake","predicted_label":"?"},{"text":"The left is going ballistic over supposed words said by President Trump to a grieving military widow.  President Trump made a call to Myeshia Wilson that s been turned into a political football by the left to make Trump out to be  crazy . Wilson s husband was killed in Niger while serving in our military so President Trump was making a sympathy call to Mrs. Wilson. Unfortunately, Wilson s family has been put in the middle of an effort to bash Trump.The media also wasted no time covering this story. They re doing their best to try and make Trump look as bad as possible Just another day in the life of the lefty media.Far left Congresswoman  Frederica Wilson jumped right in to trash Trump after the call. She s following the left s narrative by claiming Trump is a  sick man .  It s pretty funny that Wilson calls Trump crazy while wearing a glittery cowgirl hat 24\/7.The  Resist  movement includes Wilson who refused to go to Trump s inauguration. Wilson also attacked the president in May when she said said he  needs psychological help and is desperate for attention.  Perhaps Cowgirl Wilson should look in the mirror .According to left leaning propaganda news NBC: He said,  But you know he must ve known what he signed up for,  the Democrat recounted Trump saying more than once during the call to express his sympathy. According to Wilson, the conversation lasted somewhere from three to five minutes. Everyone knows when you go to war you could possibly not come back alive but you don t remind a grieving widow of that,  Wilson said.  That s so insensitive. Trump  didn t even remember his name,  Wilson recalled Myeshia Johnson telling her after the call ended, the congresswoman told MSNBC s  Morning Joe  Wednesday. She hung up the phone and said,  He didn t even remember his name,  Wilson said.  That s the hurting part. The White House said Tuesday that the president had called the families of all four service members who were killed.  He offered condolences on behalf of a grateful nation and assured them their family s extraordinary sacrifice to the country will never be forgotten,  the White House said.Asked about Wilson s characterization of the call, a White House official said Tuesday night that  the president s conversations with the families of American heroes who have made the ultimate sacrifice are private. PETE HEGSETH POINTED OUT THAT THIS IS HOW FAR THE LEFT WILL GO TO TRASH TRUMP:Pete Hegseth said on  Fox & Friends  that this is another example of Trump s opponents taking every opportunity to twist or spin his words, even if it involves a fallen soldier. They want to question at every turn what he says he s committed to,  Hegseth said.  There s no one more committed, I believe, to our service members, to our veterans than this president. He said this shows how committed Democrats are to resisting Trump no matter what.TRUMP HITS BACK:Trump hit back at the claims saying he has proof of what was said on the call:Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!  Donald J. Trump (@realDonaldTrump) October 18, 2017Wilson took no time in shooting back that Trump is a  sick man . She s clearly milking this for all it s worth. It s sick that this Democrat would use this call to a grieving widow to bash our president.","label":"fake","predicted_label":"?"},{"text":"5 broken ribs with trouble breathing, lung contusions and life-threatening possibilities is not a  minor injury  as media claimed A senior adviser for Rand Paul says the U.S. senator is recovering from five broken ribs following an assault at his home.Doug Stafford said it is unclear when Paul will return to work since he is in considerable pain and has difficulty getting around, including flying. Stafford said Sunday that the broken ribs include three displaced fractures, which can lead to life-threatening injuries. The severe pain can last for weeks or months.Police arrested 59-year-old Rene Boucher on Saturday and charged him with misdemeanor fourth-degree assault with a minor injury. Boucher is accused of attacking Paul on Friday, but officials have not released a motive.Boucher lives next door to Paul and his wife, according to Warren County property records.Boucher was released from jail on Saturday. He has not returned a call seeking comment.OUR PREVIOUS REPORT ON THE ATTACK:Another unhinged Democrat has been arrested for attacking someone with political views that are in opposition to his yawn Kentucky State Police have arrested a person accused of assaulting Sen. Rand Paul (R-Ky.) at his home in Kentucky, the senator s office confirmed on Saturday. Senator Paul was blindsided and the victim of an assault,  Kelsey Cooper, a spokeswoman for Paul, said in a statement.  The assailant was arrested and it is now a matter for the police. Senator Paul is fine. The suspect was identified as 59-year-old Rene Boucher of Bowling Green, Kent., according to a statement from Kentucky State Police reported by the Bowling Green Daily News.  True PunditBoucher is an anesthesiologist and pain specialist. He got his medical degree from Des Moines University College of Osteopathic Medicine after being pre-med at Providence College in Rhode Island, according to Doximity. Boucher has practiced medicine in since 1982 and attended high school in New Bedford, Massachusetts. Between 1985 and 1993, Boucher was pain management specialist at the Letterman Army Medical Center in San Francisco where he also did his residency.In 2005, Boucher appeared on QVC marketing a rice-filled vest that was designed to alleviate back pain, reported the Bowling Green Daily News. The vest retailed at $30 and had to be microwaved before use. The website for Therm-a-Vest is no longer active. WAVE reports that Boucher retired in 2015.In May 2017, Boucher shared a story on Facebook about Republican Congressman Greg Gianforte assaulting The Guardian s Ben Jacobs in Bozeman, Montana. The assault was described as a  body slam  at the time. Boucher writes in his Facebook bio that he is in a relationship. The Bowling Green Daily News article about Boucher s pain relieving vest saw him city his wife, Lisa, as a reason for its success.Boucher is a registered Democrat. Since Trump s ascendency to the president, Boucher has been severely critical the GOP on Facebook. Boucher is shown to be an advocate for gun control and healthcare reform. There does not seem to be any posts that target Senator Paul.   Heavy ","label":"fake","predicted_label":"?"},{"text":"New York Attorney General Eric Schneiderman isn t going to allow Donald Trump s 2016 presidential campaign get in the way of his ongoing prosecution of the GOP frontrunner for  fraud. Schneiderman is the highest profile government official looking into Trump s shady business dealings at Trump University. Customers claim that after they signed up for the opportunity, they were pressured to spend ever-increasing amounts of money with little knowledge of the real estate business to show for it.In an interview with ABC, the attorney general explained that he s not going to back off. We re ready to go,  Schneiderman, a Democrat, told ABC News today.  We sued him long before anyone thought he might run for President. This is not a political case, it s just a straight-up fraud case. Like the judge also looking into the case, Scneiderman has come in for attack by Trump, who has used his high profile to impugn the prosecutor s motives. But that hasn t dissuaded the prosecutor.Schneiderman told ABC News he is not worrying about the confluence of the campaign and his case. The documents, he said only served to offer further proof that the operation was aimed less at teaching students the skills needed to buy and sell real state, and more about making money for Trump. It was clearly a way to separate people who were desperate to make money in hard economic times from their own cash and to get it into the pocket of Mr. Trump and his cronies,  Schneiderman said.The secret Trump University documents have revealed that workers at the operation were given a step-by-step manual on how to convince prospective  students  to give the company access to their money and also explained how to prey on their emotions in pursuit of profits. Trump University is now defunct, after Trump and his partners made money off of regular people, all while egging students on to profit from the 2007-8 real estate collapse.Featured image via YouTube","label":"fake","predicted_label":"?"},{"text":"BRUSSELS (Reuters) - A leading European rights watchdog called on Turkey on Friday to ease post-coup state of emergency laws that have seen thousands arrested and restore power to regional authorities. President Tayyip Erdogan has overseen a mass purge in the armed forces and the judiciary, as well as a crackdown on critics including academics and journalists since a failed military coup in July last year.  An advisory body to the Council of Europe, of which Turkey is a member, acknowledged in a report  the need for certain extraordinary steps taken by Turkish authorities to face a dangerous armed conspiracy .  However...Turkish authorities have interpreted these extraordinary powers too extensively,  said the experts, known as the Venice Commission, in an opinion that has no legal force. It urged Ankara to lift laws allowing it to pick mayors, deputy mayors and members of local councils outside of local elections, a reference to rules the Turkish government has used to replace local pro-Kurdish politicians across the largely Kurdish southeast of the country. The experts at the Council of Europe, Europe s leading human rights organization with 47 member states, recommended Turkey set a time limit on the emergency rules and ensure proper judicial oversight of any counter-terrorism measures. Erdogan has accused U.S.-based, Islamic cleric Fethullah Gulen of orchestrating the coup, in which 250 people were killed. Gulen has denied involvement.  Since then, more than 50,000 people have been jailed pending trial over links to Gulen, while 150,000 people have been sacked or suspended from jobs in the public and private sectors. Rights groups and Turkey s Western allies - including the European Union - have been taken aback by the scale of the purge, sounding alarm that Erdogan was using the coup as a pretext to quash dissent. The government in Turkey, a NATO member, says it must neutralize the threat represented by Gulen s network deeply rooted in the army, schools and courts. ","label":"true","predicted_label":"?"},{"text":"(Reuters) - In September 2014, Gilberto Velasquez, a 38-year-old house painter from El Salvador, received life-changing news: The U.S. government had decided to shelve its deportation action against him.  The move was part of a policy change initiated by then-President Barack Obama in 2011 to pull back from deporting immigrants who had formed deep ties in the United States and whom the government considered no threat to public safety. Instead, the administration would prioritize illegal immigrants who had committed serious crimes.  Last month, things changed again for the painter, who has lived in the United States illegally since 2005 and has a U.S.-born child. He received news that the government wanted to put his deportation case back on the court calendar, citing another shift in priorities, this time by President Donald Trump.  The Trump administration has moved to reopen the cases of hundreds of illegal immigrants who, like Velasquez, had been given a reprieve from deportation, according to government data and court documents reviewed by Reuters and interviews with immigration lawyers.  Trump signaled in January that he planned to dramatically widen the net of illegal immigrants targeted for deportation, but his administration has not publicized its efforts to reopen immigration cases.  It represents one of the first concrete examples of the crackdown promised by Trump and is likely to stir fears among tens of thousands of illegal immigrants who thought they were safe from deportation.  While cases were reopened during the Obama administration as well, it was generally only if an immigrant had committed a serious crime, immigration attorneys say. The Trump administration has sharply increased the number of cases it is asking the courts to reopen, and its targets appear to include at least some people who have not committed any crimes since their cases were closed.  Between March 1 and May 31, prosecutors moved to reopen 1,329 cases, according to a Reuters' analysis of data from the Executive Office of Immigration Review, or EOIR. The Obama administration filed 430 similar motions during the same period in 2016.   Jennifer Elzea, a spokeswoman for U.S. Immigration and Customs Enforcement, confirmed the agency was now filing motions with immigration courts to reopen cases where illegal immigrants had “since been arrested for or convicted of a crime.”  It is not possible to tell from the EOIR data how many of the cases the Trump administration is seeking to reopen involve immigrants who committed crimes after their cases were closed.  Attorneys interviewed by Reuters say indeed some of the cases being reopened are because immigrants were arrested for serious crimes, but they are also seeing cases involving people who haven’t committed crimes or who were cited for minor violations, like traffic tickets.  “This is a sea change, said attorney David Leopold, former president of the American Immigration Lawyers Association. “Before, if someone did something after the case was closed out that showed that person was a threat, then it would be reopened. Now they are opening cases just because they want to deport people.”  Elzea said the agency reviews cases, “to see if the basis for prosecutorial discretion is still appropriate.”  After Obama announced his shift toward targeting illegal immigrants who had committed serious crimes, prosecutors embraced their new discretion to close cases.  Between January 2012 and Trump’s inauguration on Jan. 20, the government shelved some 81,000 cases, according to Reuters’ data analysis. These so-called “administrative closures” did not extend full legal status to those whose cases were closed, but they did remove the threat of imminent deportation.  Trump signed an executive order overturning the Obama-era policy on Jan. 25. Under the new guidelines, while criminals remain the highest priority for deportation, anyone in the country illegally is a potential target.  In cases reviewed by Reuters, the administration explicitly cited Trump's executive order in 30 separate motions as a reason to put the immigrant back on the court docket. (For a link to an excerpted document: tmsnrt.rs\/2sI6aby)  Since immigration cases aren’t generally public, Reuters was able to review only cases made available by attorneys.  In the 32 reopened cases examined by Reuters:  —22 involved immigrants who, according to their attorneys, had not been in trouble with the law since their cases were closed.  —Two of the cases involved serious crimes committed after their cases were closed: domestic violence and driving under the influence.  —At least six of the cases involved minor infractions, including speeding after having unpaid traffic tickets, or driving without a valid license, according to the attorneys.  In Velasquez’s case, for example, he was cited for driving without a license in Tennessee, where illegal immigrants cannot get licenses, he said.  “I respect the law and just dedicate myself to my work,” he said. “I don’t understand why this is happening.”  Motions to reopen closed cases have been filed in 32 states, with the highest numbers in California, Florida and Virginia, according to Reuters’ review of EOIR data. The bulk of the examples reviewed by Reuters were two dozen motions sent over the span of a couple days by the New Orleans ICE office.  Sally Joyner, an immigration attorney in Memphis, Tennessee said one of her Central American clients, who crossed the border with her children in 2013, was allowed to stay in the United States after the government filed a motion to close her case in December 2015.  Since crossing the border, the woman has not been arrested or had trouble with law enforcement, said Joyner, who asked that her client’s name not be used because of the pending legal action.  Nevertheless, on March 29, ICE filed a two-page motion to reopen the case against the woman and her children. When Joyner queried ICE, an official said the agency had been notified that her client had a criminal history in El Salvador, according to documents seen by Reuters.  The woman had been arrested for selling pumpkin seeds as an unauthorized street vendor. Government documents show U.S. authorities knew about the arrest before her case was closed.  Dana Marks, president of the National Association of Immigration Judges, said that revisiting previously closed matters will add to a record backlog of 580,000 pending immigration cases.  “If we have to go back and review all of those decisions that were already made, it clearly generates more work,” she said. “It’s a judicial do-over.”  ","label":"true","predicted_label":"?"},{"text":"HAMBURG (Reuters) - U.S. President Donald Trump on Saturday promised $639 million in aid to feed people left starving because of drought and conflict in Somalia, South Sudan, Nigeria and Yemen. Trump’s pledge came during a working session of the G20 summit of world leaders in Hamburg, providing a “godsend” to the United Nations’ World Food Programme, the group’s executive director, David Beasley, told Reuters on the sidelines of the meeting. “We’re facing the worst humanitarian crisis since World War Two,” said Beasley, a Republican and former South Carolina governor who was nominated by Trump to head the U.N. agency fighting hunger worldwide. The new funding brings to over $1.8 billion aid promised by the United States for fiscal year 2017 for the crises in the four countries, where the United Nations has estimated more than 30 million people need urgent food assistance. “With this new assistance, the United States is providing additional emergency food and nutrition assistance, life-saving medical care, improved sanitation, emergency shelter and protection for those who have been affected by conflict,” USAID said in a statement. Rob Jenkins, acting head of the USAID’s bureau of democracy, conflict and humanitarian assistance, said of the funding, over $191 million would go to Yemen, $199 million to South Sudan, $121 million to Nigeria and almost $126 million for Somalia. Conflict in all four countries had made it difficult to reach some communities in need of food, he noted. “We’re in a dire situation right now,” said Jenkins, adding that USAID was also concerned with the situation in southern Ethiopia. “The situation in southern Ethiopia fortunately does not rise to the dire situation of the other four, but the situation is deteriorating and might very well be catastrophic without additional interventions,” he said, adding that Washington had already provided some $252 million this year to Ethiopia, “but the needs continue to grow.” Beasley said the U.S. funding was about a third of what the WFP estimated was required this year to deal with urgent food needs in the four countries in crisis as well as in other areas. The WFP estimates that 109 million people around the world will need food assistance this year, up from 80 million last year, with 10 of the 13 worst-affected zones stemming from wars and “man-made” crises, Beasley said. “We estimated that if we didn’t receive the funding we needed immediately that 400,000 to 600,000 children would be dying in the next four months,” he said. Trump’s announcement came after his administration proposed sharp cuts in funding for the U.S. State Department and other humanitarian missions as part of his “America First” policy. Beasley said the agency had worked hard with the White House and the U.S. government to secure the funding, but Trump would insist that other countries contributed more as well. A WFP spokesman said Germany recently pledged an additional 200 million euros for food relief. ","label":"true","predicted_label":"?"},{"text":"NEW YORK (Reuters) - A federal judge rejected a request for a new trial by two former associates of New Jersey Governor Chris Christie who were convicted for their roles in the “Bridgegate” lane closure scandal. The decision late Wednesday by U.S. District Judge Susan Wigenton clears the way for the two defendants to be sentenced on March 15. Bridget Kelly, a former deputy chief of staff under the Republican governor, and Bill Baroni, the former deputy executive director of the Port Authority of New York and New Jersey, were convicted in November of orchestrating the shutdown of access lanes at the George Washington Bridge in September 2013. U.S. prosecutors said the resulting gridlock in Fort Lee, New Jersey, was intended to punish the town’s Democratic mayor for declining to back Christie’s re-election campaign. Christie has not been charged in the case and has denied any knowledge of the plan. But Kelly and another conspirator, former Port Authority official David Wildstein, both testified that Christie was aware of the lane closures before they occurred. Wildstein pleaded guilty and appeared at trial as the government’s star witness. In asking for an acquittal or a new trial, Kelly’s lawyers had argued that Wigenton erred when she instructed jurors that they could convict the defendants even if prosecutors failed to prove they had intentionally targeted the mayor for retribution. The motivation for the scheme, Kelly’s lawyers said, was at the core of the government’s case. But Wigenton said motive, while central to the prosecution, is not a required element of the crimes for which Baroni and Kelly were convicted. “The government was under no obligation to introduce evidence of motive, although motive helps present a coherent narrative of events to a jury,” she wrote. Lawyers for Baroni and Kelly did not immediately respond to requests for comment. They can still ask a U.S. appeals court to overturn the verdict after sentencing has taken place. A spokesman for New Jersey’s chief federal prosecutor, U.S. Attorney Paul Fishman, declined to comment on the ruling. The scandal’s fallout helped sink Christie’s once-promising political career. He was passed over for a position in President Donald Trump’s administration after his own presidential bid sputtered, and he has seen record-low approval ratings in New Jersey. ","label":"true","predicted_label":"?"},{"text":"ORANGEBURG, S.C. (Reuters) - If Democratic hopeful Bernie Sanders has a chance of drawing African-American voters away from rival Hillary Clinton in South Carolina’s presidential nominating contest on Feb. 27, his best opportunity will be among the young. African Americans support former Secretary of State Clinton by more than a 3-to-1 margin nationwide, but among young blacks 18 to 29 years old, that margin shrinks to 46 percent for Clinton versus 33 percent for Sanders, according to recent Reuters\/Ipsos polling. African Americans overwhelmingly back Democrats, but opinion polls in the run-up to the Nov. 8 presidential election show younger blacks more apt to reject an establishment candidate. They seem less inclined than their parents to reward Clinton for the outreach of her husband, former President Bill Clinton, and more drawn to Sanders’ outspoken views on reducing income inequality, cracking down on Wall Street, and cutting the cost of college. Reuters\/Ipsos polling last year showed that 36 percent of blacks between 18 and 29 years old thought the country was on the “wrong track,” compared with 23 percent of blacks who were at least 60 years old. For Sanders, a U.S. senator from Vermont who describes himself as a democratic socialist, this trend could help him chip away at Clinton’s firewall of minority voters in the southern states, after his strong showings against her - especially among the young - in the early Democratic Party contests of Iowa and New Hampshire, both more than 90 percent white. The voting-age population in South Carolina, one of the next stops on the primary trail, is about 67 percent white and 27 percent black, the U.S. Census Bureau says. In Orangeburg, South Carolina, students at the historically black schools of South Carolina State University and Claflin University appeared split this week over which of the two candidates to support. Students praised Clinton’s work on behalf of women and minorities and her years of Washington experience. But many said they also were intrigued by Sanders’ plans to raise taxes on wealthier people and Wall Street firms, provide universal healthcare and offer free public college tuition. “The history is important. But at the same time ... you still need a plan,” said Travis Pascoe, 25, a second-year graduate student at Claflin. He said Sanders’ plans for reducing inequality by taxing the wealthy and expanding Medicare to cover all Americans should resonate with the black community. “I think that would help the black community because we’re the least privileged,” he said.  Eight of 16 students interviewed were undecided voters. Of the eight students whose minds were made up, four students said they planned to vote for Clinton.  Ethel Hillman, 25, a freshman who served in the military before going to college for social work, said she and many of her fellow students were voting for Clinton. She described Sanders as too aloof. “He’s not socially connected, I would say, to the black community,” she said. “He cares from a distance.” South Carolina State’s student center, which houses a bowling center and dining area, has quotes on walls from prominent black leaders, including President Barack Obama and first lady Michelle Obama, singer Michael Jackson and educator Booker T. Washington.  On one wall is a memorial to students killed in the 1968 “Orangeburg massacre,” when protesters were shot by state highway patrol officers on campus amid tensions over racial discrimination. For Sanders, minority voters have been a lingering weakness. He struggled early in his campaign to appeal to black voters. Protesters from the Black Lives Matter movement interrupted his speeches, viewing him as out of touch with black issues. To counter that perception, Sanders touted his college civil rights activism, did publicity events with rapper Killer Mike, and on Wednesday met black civil rights leader Al Sharpton in Harlem. Like Clinton, Sanders has sent surrogates to historically black colleges. The writer and activist Cornel West spoke at South Carolina State on Sanders’ behalf, and actress Angela Bassett spoke there in support of Clinton.      Where Sanders is fighting for inroads into the black electorate, Clinton finds a comfort zone. Her campaign has said it believes its road to the nomination would become smoother once it moves south, to places where she and her husband, the former president, have ties to minority leaders. Clinton picked up the endorsement of the Congressional Black Caucus political action committee on Thursday. As the stakes mount in South Carolina, Representative Jim Clyburn, one of the state’s most influential Democrats, said he was considering endorsing a candidate. He did not endorse in Hillary Clinton’s 2008 primary race against Obama, and previously said he would not weigh in this year. His wavering was echoed in the views of several students on the campus of South Carolina State. “I’m kind of caught between Bernie Sanders and Hillary,” said Kelsie Bryant, 19, a sophomore education major at South Carolina State. She said it was important to have a woman president, and she was worried Sanders was too old. But she said his meeting with Sharpton sent a positive signal about his outreach to blacks. Cetris Brooks, 21, a senior biology major at South Carolina State, said that ultimately she was “a little bit more trusting” of Clinton because of what the former first lady meant to her family. She said her parents had long supported Clinton, and her uncle knew the former president. (This version of the story corrects paragraph 11 number of students backing Clinton to four instead of three, adds “political action committee” to paragraph 21)  (Additional reporting by Chris Kahn; Editing by Richard Valdmanis and Howard Goller) SAP is the sponsor of this content. It was independently created by Reuters’ editorial staff and funded in part by SAP, which otherwise has no role in this coverage.","label":"true","predicted_label":"?"},{"text":"(Reuters) - New York state Attorney General Eric Schneiderman intends to sue the federal government if Republican lawmakers pass proposed legislation to overhaul the U.S. healthcare system, his office said on Monday. Schneiderman’s office said it has identified “multiple constitutional defects” with the Republican healthcare bills. The U.S. Senate is considering legislation to repeal parts of the Affordable Care Act, Democratic former President Barack Obama’s signature legislative achievement, commonly known as Obamacare. However, eight to 10 Republican U.S. senators have serious concerns about the proposals, moderate Republican Senator Susan Collins, who opposes the bill, said on Sunday. Democratic state attorneys general have become a major source of opposition to Republican President Donald Trump’s policies, having successfully forced him to significantly scale back a ban on travel from six Muslim-majority countries. A group of Democrats led by Schneiderman and California Attorney General Xavier Becerra earlier this year sought to intervene in a pending lawsuit in order to defend subsidies paid to health insurers under Obamacare. The U.S. Court of Appeals for the District of Columbia Circuit has not yet ruled on that request.  Among the Republican proposals that raise constitutional issues are one that would defund the Planned Parenthood health group for a year, and another that would shift some Medicaid costs in New York from counties to the state, known as the Collins-Faso amendment, said Amy Spitalnick, a Schneiderman spokeswoman. Critics of the latter provision say it would drastically increase costs in the state budget for the Medicaid healthcare program for the poor and disabled. A Justice Department spokeswoman declined to comment on the lawsuit threat. A representative for Senate Republican leader Mitch McConnell could not immediately be reached for comment. ","label":"true","predicted_label":"?"},{"text":"JAKARTA (Reuters) - The speaker of Indonesia s parliament, who is being investigated for his suspected involvement in a $170 million graft scandal, has tendered his resignation, two members of the assembly said on Monday. Setya Novanto was arrested last month over his suspected role in the scandal linked to a national electronic identity card scheme. Anti-corruption investigators then took him into custody from where he sent a letter to assembly leaders pleading to be allowed to keep his job while he fought the charges.  Mr Novanto has resigned,  member of parliament Yandri Susanto told Reuters, referring to a letter in which Novanto announced his decision.  He didn t say why.  A replacement for him as speaker was expected to be decided by his party, Golkar, at an extraordinary meeting on Dec. 19, said Dito Ganinduto, a member of parliament from Novanto s Golkar party. Novanto had not resigned as chairman of Golkar, Ganinduto said. A lawyer for Novanto, Maqdir Ismail, deferred questions on the matter to acting Golkar chairman Idrus Marham. Marham could not be reached for comment. Novanto had clung to power through several previous corruption cases. His latest battle with the graft agency has gripped Indonesia, where newspapers have splashed the story on front pages and social media posts mocking him have been widely shared.  Before his detention last month he had for months declined to answer summonses for questioning by the Corruption Eradication Commission, known by its Indonesian initials KPK. The allegations against Novanto have reinforced the perception among Indonesians that their parliament, long regarded as riddled with entrenched corruption, is a failing institution. Indonesia was ranked last year at 90 out of 176 countries on Transparency International s corruption perception index. The watchdog has singled out parliament as Indonesia s most corrupt institution, and in July called on President Joko Widodo to protect the KPK against attempts by the legislature to weaken the commission s powers. Critics inside and outside the parliament say the root problem is money politics. ","label":"true","predicted_label":"?"},{"text":"MADRID (Reuters) - Spanish lender Sabadell decided on Thursday to transfer its legal base from Catalonia to Alicante, a bank spokeswoman said. The decision by Banco Sabadell, Spain s fifth biggest lender, comes as businesses in the wealthy northeastern region are growing increasingly worried about political upheaval there as the Catalan parliament considers whether to press ahead with a plan to unilaterally declare independence from Spain. ","label":"true","predicted_label":"?"},{"text":"WASHINGTON (Reuters) - U.S. House Speaker Paul Ryan told President Donald Trump on Friday that there are not enough votes to pass Republicans’ healthcare bill, CNN reported, citing a Republican source. Ryan, at a meeting with Trump at the White House, is seeking guidance from Trump about possible next steps, according to CNN. Republican leaders had been planning a vote later on Friday on the measure, which seeks to dismantle Obamacare. ","label":"true","predicted_label":"?"},{"text":"LONDON (Reuters) - The British government said on Tuesday that most European Union citizens currently living in Britain will be allowed to remain in the country after Brexit in 2019. Outlining plans for a mass registration program, the Department for Exiting the European Union and the interior ministry said EU nationals will be given a two-year grace period to apply for settled status after Britain leaves the EU. The legal status and rights of EU nationals is one of the thornier issues in Britain s complicated exit from the bloc. There are about 3 million EU citizens living in Britain.  Caseworkers will be able to use discretion when processing applications, meaning they should not be refused for minor technicalities, and the majority would be granted, the departments said in a statement. The cost of an application should be no more than the cost of a British passport and EU citizens will also be given a statutory right of appeal if denied.   We have been clear that safeguarding the rights of EU citizens is our top priority in negotiations,  Brexit minister David Davis said.  We will support everyone wishing to stay to gain settled status through a new straightforward, streamlined system.  ","label":"true","predicted_label":"?"}]